# Determinant Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Transform1D..::..Determinant Property
Transform1D Class See Also
---
The determinant of this transformation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public double Determinant { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Determinant As Double
	Get
```

Visual C++
---
```text
public:
property double Determinant {
	double get ();
}
```

# See Also
Transform1D Class
Autodesk.Revit.DB Namespace